{
  "backend/main.mo": "Motoko canister managing content items with admin-gated CRUD operations and permission checks.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of autogenerated summaries describing key frontend files and their roles.",
  "frontend/index.css": "Tailwind base styles defining light/dark OKLCH theme tokens and global background/text settings.",
  "frontend/index.html": "HTML entry point with inline dark background CSS and root mounting point.",
  "frontend/src/App.tsx": "Main React router setup with protected routes, page-level guards, and admin seeding.",
  "frontend/src/components/auth/RegisterModal.tsx": "Modal for user registration with form fields, validation, and success/error handling.",
  "frontend/src/components/content/AdminContentForm.tsx": "Admin form to add content via Drive links, video uploads, or documents with validation and upload tracking.",
  "frontend/src/components/content/AdminContentList.tsx": "Displays a list of admin content items with status toggles, type indicators, and deletion workflow.",
  "frontend/src/components/content/DriveVideoEmbed.tsx": "Embeds a Google Drive video or shows an error with fallback link if embedding fails.",
  "frontend/src/components/content/LiveEmbedPreview.tsx": "Shows an iframe preview of a live-embed URL with error handling and external-open option.",
  "frontend/src/components/diagnostics/ThemeDiagnosticsBanner.tsx": "Diagnostic banner that checks theme CSS, variables, and background when enabled via query param.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass-style card component with optional hover animations.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing background, navbar visibility control, and theme diagnostics.",
  "frontend/src/components/motion/AnimatedRouteWrapper.tsx": "Simple wrapper applying a fade‑in animation to routed content.",
  "frontend/src/components/motion/BabyComedyLoginAnimation.tsx": "Animated visual component showing baby‑themed images and effects for login screens.",
  "frontend/src/components/nav/Navbar.tsx": "Navigation bar component handling desktop/mobile menus, session-based access checks, and logout/navigation actions.",
  "frontend/src/components/PremiumCard.tsx": "Interactive premium card with icon, title, hover effects, and optional description/children.",
  "frontend/src/components/routing/AdminRoute.tsx": "Route guard that renders children only for admin users, redirecting others to the home page.",
  "frontend/src/components/routing/ProtectedRoute.tsx": "Ensures a session exists, redirects unauthenticated users to login, and logs page visits for authenticated users.",
  "frontend/src/components/routing/SectionRouteGuard.tsx": "Guards sections based on page permissions, redirecting unauthorized or unauthenticated users while allowing admin bypass.",
  "frontend/src/components/StatusBadge.tsx": "Status badge displaying approved or pending states with color and animation cues.",
  "frontend/src/hooks/useAccessApprovals.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useContentLibrary.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching, adding, updating, and deleting content items and checking admin status via the backend actor.",
  "frontend/src/hooks/useSession.ts": "Loads session from storage, refreshes permissions, and listens for session changes while tracking loading state.",
  "frontend/src/index.css": "Tailwind-based global styles defining a luxury dark theme, animations, glass effects, and navbar UI styling.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing users, permissions, analytics, and content items.",
  "frontend/src/pages/HomePage.tsx": "Home screen showing user details and navigation cards based on access permissions.",
  "frontend/src/pages/IntelusPage.tsx": "Displays Intelus content, separating video and document items fetched from the backend.",
  "frontend/src/pages/LivePage.tsx": "Renders live embed items or a placeholder when no live content exists.",
  "frontend/src/pages/LoginPage.tsx": "Handles user login, analytics logging, redirect logic, and optional registration modal.",
  "frontend/src/pages/MyFilesPage.tsx": "Shows user-accessible document items with options to open files.",
  "frontend/src/pages/MyVideosPage.tsx": "Displays user video content by filtering items for video types and rendering embedded or uploaded videos with metadata.",
  "frontend/src/pages/PortfolioPage.tsx": "Renders a portfolio page with a styled iframe embedding an external website.",
  "frontend/src/pages/RegisterPage.tsx": "Automatically redirects to the login page while preserving return-to parameters.",
  "frontend/src/pages/VideosPage.tsx": "Shows a static grid of embedded YouTube videos inside styled cards.",
  "frontend/src/utils/accessApprovals.ts": "Empty utility file placeholder.",
  "frontend/src/utils/analytics.ts": "LocalStorage-based analytics tracker for logins, page visits, and update subscriptions.",
  "frontend/src/utils/auth.ts": "Handles user registration, login, logout, approval, and permission updates using local storage.",
  "frontend/src/utils/contentLibrary.ts": "Empty utility file placeholder.",
  "frontend/src/utils/fileValidation.ts": "Validates video and document uploads for allowed types and size limits, with file-size formatting helpers.",
  "frontend/src/utils/googleDriveEmbed.ts": "Converts Google Drive URLs into embeddable preview links by extracting file IDs.",
  "frontend/src/utils/motion.ts": "Defines shared motion and animation configuration constants for UI transitions.",
  "frontend/src/utils/returnTo.ts": "Manages capturing, storing, and restoring return-to navigation paths during authentication flows.",
  "frontend/src/utils/seed.ts": "Seeds a default admin user into local storage if one does not exist.",
  "frontend/src/utils/storage.ts": "Provides localStorage helpers for users and sessions with change-event subscriptions.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and persisting URL parameters, including session-backed values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography/container plugins, and extended theme settings for a dark UI.",
  "frontend/vite.config.ts": "Sets up Vite with React, environment variable prefixes, aliasing, build output settings, and a dev proxy.",
  "project_state.json": "Defines the project’s current architecture, requirements, issues, and feature state for auth, permissions, and UI behavior."
}