{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic.",
  "feature_evidence.json": "JSON report listing baby-themed animation features and associated frontend file mappings.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend project files.",
  "frontend/index.css": "Defines Tailwind layers, CSS variables, dark theme tokens, and global styling rules.",
  "frontend/index.html": "Base HTML entry point loading fonts and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main app router setup with protected routes and admin seeding on load.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass-style card component with optional hover animations.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper that shows the Navbar when a session exists and renders page content.",
  "frontend/src/components/motion/AnimatedRouteWrapper.tsx": "Simple wrapper adding a fade-in animation to routed content.",
  "frontend/src/components/motion/BabyComedyLoginAnimation.tsx": "Renders baby-themed login animations using static image assets and CSS motion classes.",
  "frontend/src/components/nav/Navbar.tsx": "Navigation bar with Telus dropdown, route links, admin link, and logout handling.",
  "frontend/src/components/PremiumCard.tsx": "Premium glass card with icon, title, and hover elevation effects.",
  "frontend/src/components/routing/AdminRoute.tsx": "Guards admin-only routes by checking session role and redirecting non-admins.",
  "frontend/src/components/routing/ProtectedRoute.tsx": "Protects routes by redirecting unauthenticated users to the login page.",
  "frontend/src/components/StatusBadge.tsx": "Displays status indicators (pending, approved, rejected) with themed colors.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, and logout state.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, and custom utility classes including animations and a luxury dark theme.",
  "frontend/src/lib/utils.ts": "Exports a helper function to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Displays a user approval dashboard where admins can view, approve, or reject pending users.",
  "frontend/src/pages/HomePage.tsx": "Shows a personalized home screen with welcome text and premium feature cards for logged-in users.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login form with animations and handles authentication via the login utility.",
  "frontend/src/pages/PortfolioPage.tsx": "Embeds an external portfolio site inside a styled animated container.",
  "frontend/src/pages/RegisterPage.tsx": "Provides a registration form that submits new users for admin approval and shows success or error feedback.",
  "frontend/src/pages/VideosPage.tsx": "Renders a videos page displaying YouTube embeds in animated GlassCard components using a predefined videos array.",
  "frontend/src/utils/auth.ts": "Provides localStorage‑based registration, login, logout, and admin approval/rejection logic for users.",
  "frontend/src/utils/motion.ts": "Defines shared motion duration and CSS animation class name constants for consistent UI animations.",
  "frontend/src/utils/seed.ts": "Seeds a default approved admin user into localStorage if one does not exist.",
  "frontend/src/utils/storage.ts": "Wraps localStorage access for users and session data with typed helper functions.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, animations, typography, and extended theming options.",
  "project_state.json": "Stores overall project metadata, architecture notes, features, and image requirements."
}