{
  "backend/main.mo": "Motoko canister managing content items with admin-gated CRUD operations and status flags using authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing required frontend Firebase and login-flow changes with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files used for build planning.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme variables and applying base background/foreground rules.",
  "frontend/index.html": "HTML entry point loading main.authz.tsx with critical dark background CSS to prevent white flash on load.",
  "frontend/src/App.tsx": "Main React router setup with guarded routes, layout wrapper, and admin seeding on app mount.",
  "frontend/src/components/auth/RegisterModal.tsx": "Modal component handling user registration with form validation, submission, and success/error states.",
  "frontend/src/components/content/AdminContentForm.tsx": "Admin form for adding content via uploads, Drive links, or live embeds with validation and progress tracking.",
  "frontend/src/components/content/AdminContentList.tsx": "Displays a list of content items with type info, status toggling, and delete confirmation.",
  "frontend/src/components/content/DriveVideoEmbed.tsx": "Embeds a Google Drive video or shows an error with a fallback link if embedding fails.",
  "frontend/src/components/content/LiveEmbedPreview.tsx": "Previews live-embed URLs with iframe error handling and a fallback open-in-new-tab option.",
  "frontend/src/components/diagnostics/ThemeDiagnosticsBanner.tsx": "Diagnostic banner that checks CSS, theme variables, and background when enabled via query param.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass-style card component with optional hover animations and configurable classes.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper with background, optional navbar, session-based visibility, and diagnostics banner.",
  "frontend/src/components/motion/AnimatedRouteWrapper.tsx": "Simple wrapper adding a fade‑in animation to routed content.",
  "frontend/src/components/motion/BabyComedyLoginAnimation.tsx": "Animated visual component showing playful baby-themed graphics for the login screen.",
  "frontend/src/components/nav/Navbar.tsx": "Responsive navbar that shows links based on user access and handles navigation, dropdowns, and logout.",
  "frontend/src/components/PremiumCard.tsx": "Premium glass card with icon, animated hover effects, optional description, and click handling.",
  "frontend/src/components/routing/AdminRoute.tsx": "Route guard that only renders children for admin users and redirects others to home.",
  "frontend/src/components/routing/ProtectedRoute.tsx": "Auth-protected route wrapper that redirects unauthenticated users to login and logs page visits.",
  "frontend/src/components/routing/SectionRouteGuard.tsx": "Route guard that checks authentication and page-level access, with admins bypassing restrictions.",
  "frontend/src/components/StatusBadge.tsx": "Status badge showing approved or pending state with distinct colors and animations.",
  "frontend/src/firebase.ts": "Contains Firebase project config and placeholder exports since Firebase SDK isn't installed.",
  "frontend/src/hooks/useAccessApprovals.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAuthzState.tsx": "In-memory authorization context storing role, allowed pages, and helpers for access checks.",
  "frontend/src/hooks/useContentLibrary.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating content items using the backend actor.",
  "frontend/src/hooks/useSession.ts": "Compatibility wrapper mapping authz state to a legacy session format.",
  "frontend/src/index.css": "Tailwind base styles with custom theme variables, animations, and UI utility classes.",
  "frontend/src/lib/utils.ts": "Utility to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.authz.tsx": "Bootstraps the app with React, wrapping it in query, identity, and auth providers.",
  "frontend/src/main.tsx": "Initializes the app with React and wraps it in query and identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing users, permissions, and content analytics with editing and saving flows.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing user info and navigation cards based on session permissions.",
  "frontend/src/pages/IntelusPage.tsx": "Displays filtered Intelus content including videos and documents using animated sections.",
  "frontend/src/pages/LivePage.tsx": "Shows embedded live content items or a placeholder when none exist.",
  "frontend/src/pages/LoginPage.tsx": "Handles email/password login, authorization checks, analytics recording, and redirect logic.",
  "frontend/src/pages/MyFilesPage.tsx": "Lists document items with metadata and provides an option to open each file.",
  "frontend/src/pages/MyVideosPage.tsx": "Displays a user’s video library by filtering content items for videos and rendering embeds or file players.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows a portfolio page with a fullscreen iframe embedded inside an animated layout.",
  "frontend/src/pages/RegisterPage.tsx": "Immediately redirects to the login page while preserving any return-to parameters.",
  "frontend/src/pages/VideosPage.tsx": "Renders a static grid of YouTube video embeds using predefined IDs.",
  "frontend/src/utils/accessApprovals.ts": "Empty utility file with no implementation.",
  "frontend/src/utils/analytics.ts": "LocalStorage-based analytics tracker for logins, page visits, and real‑time update subscriptions.",
  "frontend/src/utils/auth.ts": "Handles user registration, logout placeholder, and basic admin approval and permission updates using localStorage.",
  "frontend/src/utils/contentLibrary.ts": "Empty utility file with no implementation.",
  "frontend/src/utils/fileValidation.ts": "Validates video and document files against size and type limits and provides file size formatting.",
  "frontend/src/utils/firestoreUserManagement.ts": "LocalStorage-backed mock Firestore utilities for fetching users and updating approvals and permissions.",
  "frontend/src/utils/googleDriveEmbed.ts": "Parses Google Drive URLs and converts them into embeddable preview links.",
  "frontend/src/utils/motion.ts": "Defines shared animation duration constants and CSS animation class names for UI motion.",
  "frontend/src/utils/returnTo.ts": "Manages saving, restoring, and building return-to navigation paths for authentication redirects.",
  "frontend/src/utils/seed.ts": "Seeds a default admin user into localStorage if one does not exist.",
  "frontend/src/utils/storage.ts": "LocalStorage-based user store providing CRUD utilities and deprecated session management placeholders.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, plugins, and extended theme settings for the project's design system.",
  "frontend/vite.config.ts": "Sets up Vite with React, env variable injection, aliasing, build options, and a dev server proxy.",
  "project_state.json": "Stores the project's current state, architectural requirements, known issues, and configuration notes for Firebase-based auth and Firestore-driven authorization."
}