{
  "backend/main.mo": "Motoko canister managing content items with admin‑guarded CRUD operations and map‑based storage.",
  "feature_evidence.json": "Feature evidence report listing authorization‑related requirements and associated frontend files.",
  "frontend-file-summaries.txt": "Collection of short summaries describing each frontend file’s purpose and behavior.",
  "frontend/index.css": "Global Tailwind‑based styles defining light/dark theme variables and base layout styling.",
  "frontend/index.html": "HTML entry loading main.authz.tsx with critical inline CSS for dark background on initial render.",
  "frontend/src/App.tsx": "React router configuration with layout, public routes, and protected/admin routes using multiple guards.",
  "frontend/src/components/auth/RegisterModal.tsx": "Registration modal handling user input, validation, and localStorage‑backed register workflow.",
  "frontend/src/components/content/AdminContentForm.tsx": "Form component allowing admins to add content via Drive links, video uploads, document uploads, or live embeds, with validation and progress handling.",
  "frontend/src/components/content/AdminContentList.tsx": "Displays a list of content items with type icons, status toggling, and delete confirmation, including a responsive table layout.",
  "frontend/src/components/content/DriveVideoEmbed.tsx": "Converts and embeds Google Drive video links, falling back to an error message with a direct link if embedding fails.",
  "frontend/src/components/content/LiveEmbedPreview.tsx": "Renders an iframe preview of a live embed URL and shows an error state with a fallback link if the site blocks embedding.",
  "frontend/src/components/diagnostics/ThemeDiagnosticsBanner.tsx": "Shows a diagnostics banner when enabled via URL param, checking CSS loading, theme variables, and background color.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass‑style card component with optional hover animations.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout that applies background styling, shows the navbar based on session state, and wraps page content.",
  "frontend/src/components/motion/AnimatedRouteWrapper.tsx": "Simple wrapper that applies a fade‑in animation to route content.",
  "frontend/src/components/motion/BabyComedyLoginAnimation.tsx": "Displays a playful animated baby-themed visual sequence for the login screen.",
  "frontend/src/components/nav/Navbar.tsx": "Responsive navigation bar with role-based access control, dropdown menus, and logout handling.",
  "frontend/src/components/PremiumCard.tsx": "Premium glass card with icon, title, optional description, and hover effects for dashboard items.",
  "frontend/src/components/routing/AdminRoute.tsx": "Route guard preventing access to child components unless the user has admin privileges.",
  "frontend/src/components/routing/ProtectedRoute.tsx": "Guards routes by redirecting unauthenticated users to login and records page visits for authenticated users.",
  "frontend/src/components/routing/SectionRouteGuard.tsx": "Checks authentication and per-page access, redirecting unauthorized users while allowing admins full access.",
  "frontend/src/components/StatusBadge.tsx": "Status badge component showing approved or pending states with simple animations.",
  "frontend/src/firebase.ts": "Empty placeholder file for Firebase configuration.",
  "frontend/src/hooks/useAccessApprovals.ts": "Empty placeholder hook for access approvals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useAuthzState.tsx": "Provides in-memory auth state, role checks, and page-access logic via React context.",
  "frontend/src/hooks/useContentLibrary.ts": "Empty placeholder hook for content library behavior.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, identity loading, login, and logout through a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend content operations in React Query hooks for fetching, adding, updating, and deleting content.",
  "frontend/src/hooks/useSession.ts": "Compatibility wrapper exposing session-like data from the new authz state.",
  "frontend/src/index.css": "Defines the app’s Tailwind-based dark theme, neon accents, animations, and UI utility styles.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge Tailwind classes using clsx and tailwind-merge.",
  "frontend/src/main.authz.tsx": "Bootstraps the app with Internet Identity, React Query, and Authz providers.",
  "frontend/src/main.tsx": "Bootstraps the app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing users, permissions, analytics, and content via various UI components and hooks.",
  "frontend/src/pages/HomePage.tsx": "Dashboard page showing user info and navigation cards based on role and allowed pages.",
  "frontend/src/pages/IntelusPage.tsx": "Displays Intelus videos and documents fetched from content items with loading and animated sections.",
  "frontend/src/pages/LivePage.tsx": "Renders live embed content from fetched items with loading state and fallback when none exist.",
  "frontend/src/pages/LoginPage.tsx": "Handles user login, validation, state setting, return-to redirects, and optional register modal.",
  "frontend/src/pages/MyFilesPage.tsx": "Shows a list of document items with open-file actions and loading or empty states.",
  "frontend/src/pages/MyVideosPage.tsx": "Displays video items (links or files) with embeds, metadata, and empty/loading states.",
  "frontend/src/pages/PortfolioPage.tsx": "Embeds an external portfolio page inside a styled iframe container.",
  "frontend/src/pages/RegisterPage.tsx": "Instantly redirects to the login page while preserving return-to parameters.",
  "frontend/src/pages/VideosPage.tsx": "Renders a videos page displaying embedded YouTube videos using animated cards and layout components.",
  "frontend/src/utils/accessApprovals.ts": "Empty placeholder utility file for access approval logic.",
  "frontend/src/utils/analytics.ts": "LocalStorage-backed analytics system for tracking logins, page visits, and emitting update events.",
  "frontend/src/utils/auth.ts": "Handles user registration, admin approval, and permission updates using localStorage-backed user data.",
  "frontend/src/utils/contentLibrary.ts": "Empty placeholder for content library utilities.",
  "frontend/src/utils/fileValidation.ts": "Validates video and document file types and sizes and provides file-size formatting utilities.",
  "frontend/src/utils/googleDriveEmbed.ts": "Parses Google Drive URLs to extract file IDs and generate embeddable preview URLs.",
  "frontend/src/utils/motion.ts": "Defines shared motion constants and CSS animation class mappings for UI animations.",
  "frontend/src/utils/returnTo.ts": "Manages storing and retrieving return-to paths for login redirection using sessionStorage.",
  "frontend/src/utils/seed.ts": "Seeds a default admin user into localStorage if not already present.",
  "frontend/src/utils/storage.ts": "Provides localStorage-based user management utilities and deprecated session helpers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, and container settings.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, environment variable support, aliases, and dev server settings.",
  "project_state.json": "Defines the current project state, goals, architectural notes, known issues, and existing features for moving the app to a Firestore-driven authorization model. Serves as a high-level specification and issue tracker for required fixes and behavior changes."
}