{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Wire real Firebase config and update admin login to use Firebase Auth",
  "requirements": [
    {
      "id": "REQ-63",
      "summary": "Replace placeholder Firebase module with real Firebase initialization and export working auth/db instances.",
      "acceptanceCriteria": [
        "`frontend/src/firebase.ts` no longer exports `auth = null` / `db = null`; it initializes Firebase with the exact config provided by the user.",
        "The app builds successfully with the Firebase initialization in place (no runtime import/undefined errors from the Firebase module)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/firebase.ts",
          "operation": "modify",
          "description": "Initialize Firebase using the exact user-provided firebaseConfig and export working Firebase instances (at minimum `auth` from Firebase Auth and `db` from Firestore) instead of null placeholders."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Update LoginPage to authenticate via Firebase email/password, then populate in-memory authz state from the app’s authorization user record source.",
      "acceptanceCriteria": [
        "Attempting to sign in with a valid Firebase Auth email/password succeeds and navigates to the post-login destination (return-to path if present, otherwise home).",
        "Attempting to sign in with an invalid Firebase Auth email/password shows the existing error message: \"Invalid email or password\".",
        "Attempting to sign in with a valid Firebase Auth account that is not approved (and is not admin) blocks session establishment and shows exactly: \"Your account is waiting for admin approval.\".",
        "Navbar and protected routes behave based on the in-memory authz state populated after Firebase login (no reliance on localStorage password matching)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Replace localStorage password validation with Firebase Authentication email/password sign-in. After successful sign-in, fetch the signed-in user's authorization record (role/approved/allowedPages/name/email) from the existing user storage source used for authorization and call `setAuthzState(...)`. Preserve current UI/layout and keep error strings exactly as required (including mapping invalid credentials to \"Invalid email or password\" and unapproved non-admins to \"Your account is waiting for admin approval.\")."
        },
        {
          "path": "frontend/src/utils/firestoreUserManagement.ts",
          "operation": "modify",
          "description": "Add/adjust a helper to retrieve a single user's authorization record for the signed-in account (role/approved/allowedPages/name/email) without performing any password checks, so LoginPage can populate in-memory authz state after Firebase Auth sign-in."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Remove or bypass localStorage-only admin seeding and credential checks that could override Firebase Auth results.",
      "acceptanceCriteria": [
        "Firebase Auth sign-in results solely determine whether the user is authenticated; localStorage seeded users do not cause a valid Firebase account to be rejected as \"Invalid email or password\".",
        "The app still runs without crashes even if localStorage contains previously seeded users."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove or bypass the `seedAdmin()` call so localStorage admin seeding does not influence Firebase login diagnostics or outcomes."
        },
        {
          "path": "frontend/src/utils/seed.ts",
          "operation": "modify",
          "description": "Adjust the admin seeding helper so it is safe to keep in the codebase without affecting Firebase Auth login behavior (e.g., ensure it is not required for authentication and does not override Firebase-based session establishment)."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Ensure there are no remaining localStorage credential comparisons (password matching) used to accept/reject login; Firebase Auth sign-in must be the sole source of authentication success/failure."
        }
      ]
    }
  ]
}